symmetryPlane/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	
	
    capsuleWall
    {
		type            groovyBC;
		valueExpression "(time() < 0.01) ? 101325.0 : 0";
		value uniform 0;  
    }
    
    left
    {
        type				fixedValue;
        value				uniform 0;
    }

    right
    {
        type				fixedValue;
        value				uniform 0;
    }
    
    top
    {
        type				fixedValue;
        value				uniform 0;
    }    

    bottom
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
